{"version":1,"title":"The Lion's Red Mane","description":"An exploration of thought, code architecture, open source culture, design, development, and more.","home_page_url":"http://rimij405.github.io","feed_url":"http://rimij405.github.io/feed.json","language":"en","author":{"name":"Ian Effendi","url":"http://rimij405.github.io"},"items":[{"id":"http://rimij405.github.io/blog/hfoss/lit-review-1/","url":"http://rimij405.github.io/blog/hfoss/lit-review-1/","external_url":"","title":"Literature Review #1: Bug Reporting","link":"http://rimij405.github.io/blog/hfoss/lit-review-1/","summary":"<h1 id=\"Review-How-to-Report-Bugs-Effectively\"><a href=\"#Review-How-to-Report-Bugs-Effectively\" class=\"headerlink\" title=\"Review: How to Report Bugs Effectively\"></a>Review: How to Report Bugs Effectively</h1><p>This is the first of several literature reviews for content relevant to the humanitarian free and open source software course. In this entry, I will be reviewing <em><a href=\"https://www.chiark.greenend.org.uk/~sgtatham/bugs.html\" target=\"_blank\" rel=\"noopener\">How to Report Bugs Effectively</a></em> by <a href=\"https://www.chiark.greenend.org.uk/~sgtatham/\" target=\"_blank\" rel=\"noopener\">Simon Tatham</a>.</p>","content_html":"<h1 id=\"Review-How-to-Report-Bugs-Effectively\"><a href=\"#Review-How-to-Report-Bugs-Effectively\" class=\"headerlink\" title=\"Review: How to Report Bugs Effectively\"></a>Review: How to Report Bugs Effectively</h1><p>This is the first of several literature reviews for content relevant to the humanitarian free and open source software course. In this entry, I will be reviewing <em><a href=\"https://www.chiark.greenend.org.uk/~sgtatham/bugs.html\" target=\"_blank\" rel=\"noopener\">How to Report Bugs Effectively</a></em> by <a href=\"https://www.chiark.greenend.org.uk/~sgtatham/\" target=\"_blank\" rel=\"noopener\">Simon Tatham</a>.</p>\n<a id=\"more\"></a>\n<hr>\n<img src=\"/blog/hfoss/lit-review-1/coding.jpg\" title=\"Image of laptop with code.\">\n<h2 id=\"The-Basics\"><a href=\"#The-Basics\" class=\"headerlink\" title=\"The Basics\"></a>The Basics</h2><p>At the start of the essay, the author, Simon Tatham, modestly titles himself a professional and free-software programmer. Tatham, however, is famous for creating and maintaining <a href=\"https://en.wikipedia.org/wiki/PuTTY\" target=\"_blank\" rel=\"noopener\">PuTTY</a>, an open-source implementation of Telnet and Secure Shell (SSH) clients for Unix and Windows platforms. It’s fair to say that Tatham has experience with reporting and solving bugs in open-source software.</p>\n<p>From the jump, Tatham plainly states the purpose of this guide: reading it will help developers write, “clear, helpful, <em>informative</em> bug reports.” By appraoching the written work with prepared examples and instances of unhelpful reporting practices, Tatham is able to help readers troubleshoot their own bug reporting practices. Notice you’re following a bad practice - this enables you to safely learn from that mistake and adjust course.</p>\n<p>You can find this essay on Simon Tatham’s personal website, <a href=\"https://www.chiark.greenend.org.uk/~sgtatham/bugs.html\" target=\"_blank\" rel=\"noopener\">here</a>.</p>\n<h2 id=\"The-Gist\"><a href=\"#The-Gist\" class=\"headerlink\" title=\"The Gist\"></a>The Gist</h2><p>This guide helps users report bugs to programmers. It’s written in such a way that it prescribes approaches that the user can undertake when reporting a bug. It is precise, in explaining just how important detail is to the programmer, for users reporting bugs.</p>\n<hr>\n<img src=\"/blog/hfoss/lit-review-1/good-idea.jpg\" title=\"Photo of a lightbulb doodle, pinned to corkboard.\">\n<h2 id=\"The-Good\"><a href=\"#The-Good\" class=\"headerlink\" title=\"The Good\"></a>The Good</h2><ul>\n<li>1) Clear, practical examples that a user can review (if given the time) for writing their own bug reports. (The poor formatting, however, is Bad item #1).</li>\n<li>2) The summary at the end of the entry is something that I wish more articles and blog posts had, especially when it comes to development and software tutorials.</li>\n<li>3) It comes in several different languages!</li>\n</ul>\n<hr>\n<img src=\"/blog/hfoss/lit-review-1/thinking.jpg\" title=\"Image of someone staring at a laptop with concern.\">\n<h2 id=\"The-Bad\"><a href=\"#The-Bad\" class=\"headerlink\" title=\"The Bad\"></a>The Bad</h2><ul>\n<li>1) The lack of spacing and formatting on the webpage makes it very diffiuclt to read. I want to be able to come back to this page while writing a bug report, scan for advice on the section I’m writing, and complete my report as quickly as possible.</li>\n<li>2) This is written from the perspective of the user and the user alone. While useful for other developers for providing informative bug reports, the generalized presentation doesn’t help programmers know what questions to ask. That process is something you’ll learn largely from practice, experience, and a strong understanding of the codebase. This isn’t necessarily a bad thing, but, this can be a barrier for new contributers.</li>\n<li>3) It doesn’t mention what users should do in the event repositories are archived. I think it would have been a good note to address what options they have - even one as simple as, “Find a new project that fulfills your needs if you don’t have the time/resources/skills to continue working on this one.”</li>\n</ul>\n<hr>\n<img src=\"/blog/hfoss/lit-review-1/questionmark.jpg\" title=\"High exposure photograph of a question mark drawn with neon light.\">\n<h2 id=\"Q-amp-A\"><a href=\"#Q-amp-A\" class=\"headerlink\" title=\"Q&amp;A\"></a>Q&amp;A</h2><ul>\n<li>1) Is this work up-to-date? Are there new best practices for reporting bugs?</li>\n<li>2) What cases are there where a user shouldn’t freeze and should try to act quickly to document the issue?</li>\n<li>3) What about situations where an open-source project is led by programmers who aren’t receptive to beginners filing incomplete bug reports and are rude about it? Should there be dedicated bug handlers? Does it factor into the decision to make a hostile fork?</li>\n</ul>\n<hr>\n<h2 id=\"Follow-Up\"><a href=\"#Follow-Up\" class=\"headerlink\" title=\"Follow-Up\"></a>Follow-Up</h2><p>If I’m being honest, as I am reading this for class, a lot of this was already clear to me due to best practices in communicating issues that need debuging among team members in my past programming projects. That being said, I would agree that this is an essential read for those looking to get involved with bug reporting and helping with documentation.</p>\n","date_published":"2019-01-31T03:16:03.000Z","date_modified":"2019-01-31T03:36:34.762Z","author":{"name":"Ian Effendi","url":"http://rimij405.github.io"},"tags":"blog,hfoss"},{"id":"http://rimij405.github.io/blog/cybersecurity/mission-authentication/","url":"http://rimij405.github.io/blog/cybersecurity/mission-authentication/","external_url":"","title":"Mission: Authentication","link":"http://rimij405.github.io/blog/cybersecurity/mission-authentication/","summary":"<h1 id=\"Mission-Authentication\"><a href=\"#Mission-Authentication\" class=\"headerlink\" title=\"Mission: Authentication\"></a>Mission: Authentication</h1><p>Today’s little server-side experimentation dealt with ssh security and authentication. I’ll admit, I’ve been logging into my personal server using a password.</p>\n<p>Before we dive into it, as a <strong>disclaimer</strong>:</p>\n<blockquote>\n<p><strong>I am in no way a cryptologist, cryptographer, or security expert. The material written here was taken from around the web, and, as all things, is subject to human error.</strong></p>\n</blockquote>\n<p>That <a href=\"https://simple.wikipedia.org/wiki/Cleartext\" target=\"_blank\" rel=\"noopener\">cleartext</a> security information has been passing through my tunnels ever since I started working on that server. It was simply time to move one step up in the world of authentication - it was time to use some <em>cryptography</em>.</p>","content_html":"<h1 id=\"Mission-Authentication\"><a href=\"#Mission-Authentication\" class=\"headerlink\" title=\"Mission: Authentication\"></a>Mission: Authentication</h1><p>Today’s little server-side experimentation dealt with ssh security and authentication. I’ll admit, I’ve been logging into my personal server using a password.</p>\n<p>Before we dive into it, as a <strong>disclaimer</strong>:</p>\n<blockquote>\n<p><strong>I am in no way a cryptologist, cryptographer, or security expert. The material written here was taken from around the web, and, as all things, is subject to human error.</strong></p>\n</blockquote>\n<p>That <a href=\"https://simple.wikipedia.org/wiki/Cleartext\" target=\"_blank\" rel=\"noopener\">cleartext</a> security information has been passing through my tunnels ever since I started working on that server. It was simply time to move one step up in the world of authentication - it was time to use some <em>cryptography</em>.</p>\n<a id=\"more\"></a>\n<h2 id=\"Overview\"><a href=\"#Overview\" class=\"headerlink\" title=\"Overview\"></a>Overview</h2><p>As always, I like to make sure I understand what it is I’m playing with. Cryptology? Cryptography? Aren’t they the same thing?</p>\n<p>Well, according to <a href=\"https://crypto.stackexchange.com/users/23623/sejpm\" target=\"_blank\" rel=\"noopener\">@SEJPM</a> and <a href=\"https://crypto.stackexchange.com/users/29574/lery\" target=\"_blank\" rel=\"noopener\"><em>@Lery</em></a> over at the Crypto StackExchange, there are a couple of related terms that tend to be used <a href=\"https://crypto.stackexchange.com/questions/57818/is-there-any-difference-between-cryptography-and-cryptology\" target=\"_blank\" rel=\"noopener\">interchangeably</a>.</p>\n<h3 id=\"Semantics\"><a href=\"#Semantics\" class=\"headerlink\" title=\"Semantics\"></a>Semantics</h3><p>To get down to the semantics:</p>\n<blockquote>\n<p><em>Cryptology</em> is the study of cryptography (Definition 1.1) and cryptanalysis.</p>\n</blockquote>\n<p>In other words, it’s referred to as the, “science of cryptography.”</p>\n<blockquote>\n<p><em>Cryptography</em> is the study of mathematical techniques related to aspects of information security such as confidentiality, data integrity, entity authentication, and data origin authentication.</p>\n</blockquote>\n<p>Cryptography deals with the actual security, in practice. There’s also one other term:</p>\n<blockquote>\n<p><em>Cryptanalysis</em> is the study of mathematical techniques for attempting to defeat cryptographic techniques, and, more generally, information security services.</p>\n</blockquote>\n<p>That’s where the techniques are used to evaluate cryptographic practices. It’s good to keep these things in mind when we talk about modern cryptology.</p>\n<h3 id=\"The-Past\"><a href=\"#The-Past\" class=\"headerlink\" title=\"The Past\"></a>The Past</h3><p>While the actual study of the practice is relatively young - <a href=\"https://access.redhat.com/blogs/766093/posts/1976023\" target=\"_blank\" rel=\"noopener\">within 100 years, according to Huzaifa Sidhpurwala</a> - cryptography itself has been around for thousands of years. The encryption of messages by hand have been used to keep sensitive secrets away from prying eyes; one of the earliest known and simplest ciphers in history is known as the <a href=\"http://practicalcryptography.com/ciphers/caesar-cipher/\" target=\"_blank\" rel=\"noopener\">Caeser cipher, or substitution cipher</a>. It took it’s name from Julius Caeser who used it to keep military communications secret.</p>\n<h3 id=\"The-Now\"><a href=\"#The-Now\" class=\"headerlink\" title=\"The Now\"></a>The Now</h3><p>Security on the interet, in some ways, hasn’t changed. We still encrypt our text and we still rely on messages that travel between endpoints. Today we use public-key cryptography, or asymmetric cryptography, in various sceruity models ranging from authentication, authorization, and more.</p>\n<h2 id=\"Authentication\"><a href=\"#Authentication\" class=\"headerlink\" title=\"Authentication\"></a>Authentication</h2><p>When our client reaches out to our server/host, one crucial part in the step is to authenticate both parties.</p>\n<h3 id=\"Client-Side\"><a href=\"#Client-Side\" class=\"headerlink\" title=\"Client-Side\"></a>Client-Side</h3><p>On the client-side, this might look like a host key fingerprint. By keeping track of this information, the client can verify that the host on the other side of the connection is, in fact, who they say they are.</p>\n<h3 id=\"Server-Side\"><a href=\"#Server-Side\" class=\"headerlink\" title=\"Server-Side\"></a>Server-Side</h3><p>If the server is given a public key by the client, it can check to ensure the client has the accompanying private key whenever it connects. If the key is given passphrase protection, the client is responsible for authenticating the key before it can be trusted by the server as well!</p>\n<h2 id=\"SSH\"><a href=\"#SSH\" class=\"headerlink\" title=\"SSH\"></a>SSH</h2><p>Secure Shell (SSH) is a cryptographic <a href=\"https://man.openbsd.org/ssh.1\" target=\"_blank\" rel=\"noopener\">remote login program</a>, providing a secure channel over an unsecured network in client-server architecture. We can use applications that leverage this protocol to do things like manage files remotely, update repositories, and transfer files.</p>\n<img src=\"/blog/cybersecurity/mission-authentication/pankaj-patel-729895-unsplash_large.jpg\" title=\"Screenshot of GitHub ssh session - Image by Pankaj Patel\">\n<p>One strategy for securing this channel is through the use of the public-key cryptography. With great power comes great responsibility: the ability to execute command remotely is great for DevOps and sysadmins, but, the remote communication can be exposed to a lot of third-party actors.</p>\n<p><strong>PasswordAuthentication</strong></p>\n<p>Logging into a secure shell remotely can vary depending on the host’s settings, but, for the most part, clients typically connect to a host by providing a username, hostname, and port. The most basic of authentication allows users to enter a password (that is sent as cleartext) over the network. While this is the easiest way to remote login to a server, it’s also the least secure.</p>\n<p><strong>ChallengeResponseAuthentication</strong></p>\n<p>Similar to PasswordAuthentication, users have to enter a password through a keyboard-interactive terminal in order to successfully authenticate their client to the host. Unlike PasswordAuthentication, this Authentication protocol can vary in security. Sometimes known as the <a href=\"https://en.wikipedia.org/wiki/Challenge-Handshake_Authentication_Protocol\" target=\"_blank\" rel=\"noopener\">Challenge-Handshake Authentication Protocol</a> (CHAP), the host issues a challenge to the client. Once received, the client will combine that challenge with a secret that’s shared between them - this is usually the password - and calculate a hashed value from it, before sending that value back to the host. The host, which should have the expected shared secret already stored, will calculate the expected value on its end before comparing it to the response from the client. If the challenge is successfully met (meaning the user input the correct shared secret), the authentication is considered successful. Some versions will allow the host to send new challenges to the client at random intervals to continually check the authenticity of the client.</p>\n<h3 id=\"Key-Fingerprints\"><a href=\"#Key-Fingerprints\" class=\"headerlink\" title=\"Key Fingerprints\"></a>Key Fingerprints</h3><p>In public-key cryptography, a public key fingerprint is a short sequence of bytes used to identify a longer public key. Fingerprints are created by applying a cryptographic hash function to a public key. Since fingerprints are shorter than the keys they refer to, they can be used to simplify certain key management tasks.</p>\n<p>These keys are meant to be human readable for the purposes of identification: often public keys will be encoded into hexadecimal strings like below:</p>\n<p><code>43:51:43:a1:b5:fc:8b:b7:0a:3a:a9:b1:0f:66:73:a8</code></p>\n<p>Fingerprints won’t always look like the MD5 hash above. SHA-1 fingerprints are often nothing more than a string of hexadecimal digits: <code>2fd4e1c67a2d28fced849ee1bb76e7391b93eb12</code>.</p>\n<h3 id=\"ssh-keygen\"><a href=\"#ssh-keygen\" class=\"headerlink\" title=\"ssh-keygen\"></a>ssh-keygen</h3><p><code>ssh-keygen</code> is a command line tool that <a href=\"https://man.openbsd.org/ssh-keygen.1\" target=\"_blank\" rel=\"noopener\">generates, manages, and converts authentication keys</a> for SSH. Keys generated with this tool default to the OpenSSH-specific format. Generally, a user will generate the public key and indicate where to store the private key, before protecting them with a passphrase. While the names can be changed, in the OpenSSH format, private keys are stored in plaintext without a file extension and public keys are given the, ‘.pub’ file extension. Although they are stored in plaintext, the data held inside them is a mix of randomly generated content based on an crpytographic algorithm. Knowing the content of one file in isolation does little to risk the host as they can easily be revoked. (This does, however, require the sysadmin know of a breach).</p>\n<p>The tool can also be used to check the fingerprints of certain keys! Host keys are created without a passphrase as they serve as identity markers more so than authentication checks.</p>\n<p>The following command takes a public host key created with the ED25519 algorithm, and outputs the fingerprint as an MD5 hash:</p>\n<p><code>ssh-keygen -l -E md5 -f ssh_host_ed25519_key.pub</code>.</p>\n<p>By default, the fingerprint command will display a SHA256 hash:</p>\n<p><code>ssh-keygen -lf ssh_host_ed25519_key.pub</code></p>\n<p>Knowing how to get a particular formatted hash is important when checking if a host’s fingerprint has changed.</p>\n<h3 id=\"PuTTY\"><a href=\"#PuTTY\" class=\"headerlink\" title=\"PuTTY\"></a>PuTTY</h3><p>One method for setting up SSH Public-key cryptography is with <a href=\"https://www.putty.org/\" target=\"_blank\" rel=\"noopener\">PuTTY</a>, a terminal emulator that can act as a client for SSH, Telnet, rlogin, and raw TCP communication protocols.</p>\n<p>PuTTY is joined by a few additional applications that are often run in its suite, such as PuTTYgen, an asymmetric cryptography key generation utility. Their application allows you to generate a public and private key for use in the system. In this case, private keys can be exported to the open-source OpenSSH format or as a PuTTY Private-key (*.ppk) file, a propriatary format.</p>\n<p>You can also control the host key algorithm preference when authenticating to a host for the first time. If a client doesn’t have a key in one algorithm, it will move onto the next algorithm in the preference list.</p>\n<h3 id=\"ssh-agent\"><a href=\"#ssh-agent\" class=\"headerlink\" title=\"ssh-agent\"></a>ssh-agent</h3><p>The <code>ssh-agent</code> is a program that <a href=\"https://man.openbsd.org/ssh-agent.1\" target=\"_blank\" rel=\"noopener\">holds private keys used for public-key cryptography authentication</a>. Initially, a system’s ssh-agent will not have any private keys, but, as users <code>ssh-add</code> private keys to the client, they’ll be able to authenticate automatically when the host requests their key.</p>\n<p>The general process is to generate both a public and private key, before placing the public key on the host. The client keeps track of the local private key and presents it upon SSH login to a remote host. When the host uses the public key to request the private key, if the client does not have the private key, times out, or cannot enter the correct passphrase after a set amount of attempts, the authentication process will fail.</p>\n<h2 id=\"Final-Thoughts\"><a href=\"#Final-Thoughts\" class=\"headerlink\" title=\"Final Thoughts\"></a>Final Thoughts</h2><p>Certifications on the Secure Socket Layer and Secure Shell logins both require public-key cryptography in order to remain secure. These algorithms are not bullet proof, but, they can take a very long time to brute force and crack.</p>\n<p>At the end of the day, keys are generated in a pseudorandom process; it will always remain theoretically possible to crack algorithmic security systems, so long as there is an infinite amount of time and processing power.</p>\n<p>That shouldn’t scare you from securing your server and your platforms! It is unrealistic to expect anyone to crack the toughest of algorithms (short of an unknown backdoor exploitation) within any sort of reasonable amount of time, in today’s age of technological dreams.</p>\n<p>While I’m not new to being a system admin for Linux-based servers, I am paying more attention to the security that protects my data and information. You should too!</p>\n","date_published":"2019-01-25T03:09:42.000Z","date_modified":"2019-01-31T03:27:17.114Z","author":{"name":"Ian Effendi","url":"http://rimij405.github.io"},"tags":"blog,cybersecurity"},{"id":"http://rimij405.github.io/blog/hfoss/hello-world/","url":"http://rimij405.github.io/blog/hfoss/hello-world/","external_url":"","title":"It Started With a Bang!","link":"http://rimij405.github.io/blog/hfoss/hello-world/","summary":"<h1 id=\"It-Started-With-a-BANG\"><a href=\"#It-Started-With-a-BANG\" class=\"headerlink\" title=\"It Started With a BANG\"></a>It Started With a BANG</h1><p>At least, I wish creating a personal website was as cinematic and bombastic as a Michael Bay-directed Transformers film. Alas, as with most projects, it takes a little bit of research to know what we’re getting into. Let’s take a look at how this site was made, shall we?</p>","content_html":"<h1 id=\"It-Started-With-a-BANG\"><a href=\"#It-Started-With-a-BANG\" class=\"headerlink\" title=\"It Started With a BANG\"></a>It Started With a BANG</h1><p>At least, I wish creating a personal website was as cinematic and bombastic as a Michael Bay-directed Transformers film. Alas, as with most projects, it takes a little bit of research to know what we’re getting into. Let’s take a look at how this site was made, shall we?</p>\n<a id=\"more\"></a>\n<h2 id=\"First-Flight\"><a href=\"#First-Flight\" class=\"headerlink\" title=\"First Flight\"></a>First Flight</h2><h3 id=\"IRC\"><a href=\"#IRC\" class=\"headerlink\" title=\"IRC\"></a>IRC</h3><p>I decided to use <a href=\"https://hexchat.github.io/\" target=\"_blank\" rel=\"noopener\">HexChat</a>, and registered my nick: effendiian.</p>\n<h3 id=\"Email\"><a href=\"#Email\" class=\"headerlink\" title=\"Email\"></a>Email</h3><p>I signed up for the <a href=\"https://lists.rit.edu/mailman/listinfo.mmcgi/floss-seminar\" target=\"_blank\" rel=\"noopener\">floss-seminar discussion</a> mailing list!</p>\n<h2 id=\"Getting-Started\"><a href=\"#Getting-Started\" class=\"headerlink\" title=\"Getting Started\"></a>Getting Started</h2><p>Finally I was ready to work on my blog. After I put on my Spotify playlist of, “<a href=\"https://open.spotify.com/user/1271966423/playlist/6MlIJGplHSLlgmQgb0BKpw?si=khc3sdT-Sce904oMTdbeKQ\" target=\"_blank\" rel=\"noopener\">Iconic, Inspirational, and Intriguing</a>“ orcheastral music, it was time to get to work. Before I could choose a framework to get started with, I needed to <em>know</em> what it was that I wanted to create.</p>\n<h3 id=\"Priority-Features\"><a href=\"#Priority-Features\" class=\"headerlink\" title=\"Priority Features\"></a>Priority Features</h3><p>The term <a href=\"https://en.wiktionary.org/wiki/blog\" target=\"_blank\" rel=\"noopener\"><em>blog</em></a> is the shortened form of <em>weblog</em>, a term coined by Jorn Barger in the early days of the internet. It’s a space for authors to journal thoughts and share them publicly. As such, there are a series of features expected of modern blog format websites.</p>\n<ul>\n<li><strong>Publish posts</strong>. It’s important that the time it takes to write and publish entries is quick, painless, and easy. The simpler the process is, the better.</li>\n<li><strong>Use an RSS feed</strong>. This is necessary for my own personal needs; RSS/ATOM feeds are incredibly useful for aggregators and I would like to incorporate that with my solution.</li>\n<li><strong>Open source</strong>. A big part of my work is going to emphasize open source technologies. It’s only fitting that the blog itself is built with open source tools as well.</li>\n<li><strong>Free hosting</strong>. Less of a user feature and more of a development limitation, the website needs to be hosted for free. The budget is nil. Zilch. Nada. Free.</li>\n</ul>\n<h3 id=\"Secondary-Features\"><a href=\"#Secondary-Features\" class=\"headerlink\" title=\"Secondary Features\"></a>Secondary Features</h3><p>These additional features are great for quality of life and I kept them in mind while searching for the tools that I would use in order to make the blog.</p>\n<ul>\n<li><strong>Multimedia support</strong>. Not all my work involves code. Graphic design, artwork, and animations that I create should be able to reside on the website.</li>\n<li><strong>Customizable Theme</strong>. I like to have control over my website’s layout. This way, I can iterate the design across several periods of development, instead of implementing everything all at once.</li>\n<li><strong>Comment System</strong>. Allowing people to comment on my articles would not be a bad idea.</li>\n</ul>\n<h2 id=\"What-Type-of-Website\"><a href=\"#What-Type-of-Website\" class=\"headerlink\" title=\"What Type of Website\"></a>What Type of Website</h2><p>I’ll be hosting my website on GitHub using <a href=\"https://help.github.com/articles/using-a-static-site-generator-other-than-jekyll/\" target=\"_blank\" rel=\"noopener\"><strong>GitHub Pages</strong></a> - but I won’t be using <a href=\"https://jekyllrb.com/\" target=\"_blank\" rel=\"noopener\">Jekyll</a>. Instead, I’ll be using the static-site generator Hexo, for these reasons:</p>\n<ul>\n<li><strong>Easy GitHub Pages publishing</strong>. While Jekyll does have GitHub pages support and integration, the differences needed in order to host Hexo’s generated sites are minimal.</li>\n<li><strong>Extensibility with NodeJS</strong>. The NodeJS integration delivers the rich package ecosystem on npm (and yarn) to Hexo developers.</li>\n<li><strong>Speedy</strong>. Node is speedy; as a result, Hexo generates its static files in a matter of seconds. This is one advantage to using Hexo over Jekyll:</li>\n<li><strong>Unopinionated Asset Handling</strong>. Unlike Jekyll, Hexo doesn’t come with an asset pipeline for pre-processing assests by default. Instead, you’re encouraged to roll what works for your setup using Node utilities.</li>\n<li><strong>Template How You Want To</strong>. Hexo contains support for several types of templating engines, including <a href=\"https://github.com/paularmstrong/swig\" target=\"_blank\" rel=\"noopener\">Swig</a> (by default), <a href=\"https://github.com/hexojs/hexo-renderer-ejs\" target=\"_blank\" rel=\"noopener\">EJS</a>, <a href=\"https://github.com/hexojs/hexo-renderer-haml\" target=\"_blank\" rel=\"noopener\">Haml</a>, and <a href=\"https://github.com/hexojs/hexo-renderer-jade\" target=\"_blank\" rel=\"noopener\">Jade</a>/<a href=\"https://github.com/maxknee/hexo-render-pug\" target=\"_blank\" rel=\"noopener\">Pug</a>. Although good, Jekyll is limited to the Liquid templating engine.</li>\n<li><strong>Local CMS</strong>. Both Hexo and Jekyll have this option that isn’t true for all static-site generators; access to a local development CMS through <a href=\"https://github.com/jaredly/hexo-admin\" target=\"_blank\" rel=\"noopener\">Hexo Admin</a> and <a href=\"https://github.com/jekyll/jekyll-admin\" target=\"_blank\" rel=\"noopener\">Jekyll Admin</a>, respectively.</li>\n</ul>\n<h2 id=\"The-JAMStack\"><a href=\"#The-JAMStack\" class=\"headerlink\" title=\"The JAMStack\"></a>The JAMStack</h2><p>By using Hexo to create content and hosting my static content on GitHub Pages, we end up with a website that’s been built on what’s known as the <a href=\"https://jamstack.org/\" target=\"_blank\" rel=\"noopener\">JAMStack</a>.</p>\n<blockquote>\n<p><strong>J</strong>avaScript<br><strong>A</strong>PIs<br><strong>M</strong>arkup</p>\n</blockquote>\n<p>JAM is sticky and it holds the pieces all together. There are benefits (as listed on <a href=\"https://jamstack.org/best-practices/\" target=\"_blank\" rel=\"noopener\">their site</a>) that come with using this stack.</p>\n<h2 id=\"Working-With-Hexo\"><a href=\"#Working-With-Hexo\" class=\"headerlink\" title=\"Working With Hexo\"></a>Working With Hexo</h2><p>Hexo’s extensibility offers a lot of power if you’re willing to put in the extra work to set things up. By default, Hexo projects are initialized with a standard set of plugins and is installed with the default theme, <a href=\"https://github.com/hexojs/hexo-theme-landscape\" target=\"_blank\" rel=\"noopener\">Landscape</a>.</p>\n<h3 id=\"Plugins\"><a href=\"#Plugins\" class=\"headerlink\" title=\"Plugins\"></a>Plugins</h3><p>I used these additional plugins while setting up the site:</p>\n<ul>\n<li><a href=\"https://github.com/adamsiwiec/hexagon\" target=\"_blank\" rel=\"noopener\">Hexagon</a> - Package manager for installing Hexo plugins and themes.</li>\n<li><a href=\"https://github.com/hexojs/hexo-generator-archive\" target=\"_blank\" rel=\"noopener\">Archive Generator</a> - Generates a blog post archive.</li>\n<li><a href=\"https://github.com/hexojs/hexo-generator-feed\" target=\"_blank\" rel=\"noopener\">Feed Generator</a> - Generates feed for ATOM or RSS2 aggregators.</li>\n<li><a href=\"https://www.npmjs.com/package/hexo-generator-search\" target=\"_blank\" rel=\"noopener\">Search Generator</a> - Generates a search index with configuration options available.</li>\n<li><a href=\"https://github.com/hexojs/hexo-deployer-git\" target=\"_blank\" rel=\"noopener\">Git Deployer</a> - Allows Hexo to deploy to a git repository.</li>\n</ul>\n<h3 id=\"Themes\"><a href=\"#Themes\" class=\"headerlink\" title=\"Themes\"></a>Themes</h3><p>I used this theme for my website:</p>\n<ul>\n<li><a href=\"https://github.com/probberechts/hexo-theme-cactus\" target=\"_blank\" rel=\"noopener\">Cactus (Dark)</a>.</li>\n</ul>\n<p>This should give a good overview of how this website was created. All that’s left is to put up some posts on the website itself!</p>\n<h2 id=\"Tools\"><a href=\"#Tools\" class=\"headerlink\" title=\"Tools\"></a>Tools</h2><p>I used the following open source tools during the creation of this website.</p>\n<h3 id=\"Joplin\"><a href=\"#Joplin\" class=\"headerlink\" title=\"Joplin\"></a><a href=\"https://joplin.cozic.net/\" target=\"_blank\" rel=\"noopener\">Joplin</a></h3><p>Joplin is a free, open source note taking and to-do application, which can handle a large number of notes organised into notebooks. The notes are searchable, can be copied, tagged and modified either from the applications directly or from your own text editor. The notes are in Markdown format. This was useful for drafting blog posts and keeping track of all the resources I needed to use.</p>\n<h3 id=\"Draw-io\"><a href=\"#Draw-io\" class=\"headerlink\" title=\"Draw.io\"></a><a href=\"https://github.com/jgraph/drawio/blob/master/LICENSE\" target=\"_blank\" rel=\"noopener\">Draw.io</a></h3><p>Useful for putting up wireframes when designing website layouts.</p>\n<h3 id=\"Hexo-gitignore\"><a href=\"#Hexo-gitignore\" class=\"headerlink\" title=\"Hexo .gitignore\"></a><a href=\"https://gist.github.com/spacemonkey/0a9a69004c11f82fc894\" target=\"_blank\" rel=\"noopener\">Hexo .gitignore</a></h3><p>Used this .gitignore file as the base of my own.</p>\n<h3 id=\"Real-Favicon-Generator\"><a href=\"#Real-Favicon-Generator\" class=\"headerlink\" title=\"Real Favicon Generator\"></a><a href=\"https://realfavicongenerator.net/\" target=\"_blank\" rel=\"noopener\">Real Favicon Generator</a></h3><p>Used to create the favicon for the browser and for other application platforms (iOS, Android, etc.).</p>\n<h3 id=\"Game-Icons\"><a href=\"#Game-Icons\" class=\"headerlink\" title=\"Game-Icons\"></a><a href=\"https://game-icons.net/\" target=\"_blank\" rel=\"noopener\">Game-Icons</a></h3><p>Ever growing collection of free game icons. PNG and SVG file formats available.</p>\n","date_published":"2019-01-25T00:20:03.464Z","date_modified":"2019-01-31T03:18:03.637Z","author":{"name":"Ian Effendi","url":"http://rimij405.github.io"},"tags":"blog,hfoss"},{"id":"http://rimij405.github.io/blog/hfoss/next-steps/","url":"http://rimij405.github.io/blog/hfoss/next-steps/","external_url":"","title":"Next Steps","link":"http://rimij405.github.io/blog/hfoss/next-steps/","summary":"<h1 id=\"The-Way-It-Goes\"><a href=\"#The-Way-It-Goes\" class=\"headerlink\" title=\"The Way It Goes\"></a>The Way It Goes</h1><p>I recently read <a href=\"https://dev.to/dechamp/25-years-of-coding-and-im-just-beginning-442n\" target=\"_blank\" rel=\"noopener\">25 years of coding, and I’m just beginning</a> by dev.to user DeChamp, and found some intriguing responses across the web. One particular <a href=\"https://www.pskirko.com/2019/01/20/re-25-years-of-coding/\" target=\"_blank\" rel=\"noopener\">Re:</a> came from <a href=\"https://www.pskirko.com/\" target=\"_blank\" rel=\"noopener\">Peter Skirko</a>. Rather than read back the very relatable thoughts and ideas they both covered, as pertains to development, I thought I’d begin with it to share where my mental state has recently turned to.</p>","content_html":"<h1 id=\"The-Way-It-Goes\"><a href=\"#The-Way-It-Goes\" class=\"headerlink\" title=\"The Way It Goes\"></a>The Way It Goes</h1><p>I recently read <a href=\"https://dev.to/dechamp/25-years-of-coding-and-im-just-beginning-442n\" target=\"_blank\" rel=\"noopener\">25 years of coding, and I’m just beginning</a> by dev.to user DeChamp, and found some intriguing responses across the web. One particular <a href=\"https://www.pskirko.com/2019/01/20/re-25-years-of-coding/\" target=\"_blank\" rel=\"noopener\">Re:</a> came from <a href=\"https://www.pskirko.com/\" target=\"_blank\" rel=\"noopener\">Peter Skirko</a>. Rather than read back the very relatable thoughts and ideas they both covered, as pertains to development, I thought I’d begin with it to share where my mental state has recently turned to.</p>\n<a id=\"more\"></a>\n<h2 id=\"The-Next-Steps\"><a href=\"#The-Next-Steps\" class=\"headerlink\" title=\"The Next Steps\"></a>The Next Steps</h2><p>I chose to use the <a href=\"https://jamstack.org\" target=\"_blank\" rel=\"noopener\">JAMStack</a> to <a href=\"/blog/hfoss/hello-world/\" title=\"build my website\">build my website</a> because it should be quick, painless, and easy to write posts and get them published to the live site. This post, in some ways, is a test of that. That brings me to figuring out the next steps for my blog. While I want to add much, much more in terms of a portfolio, at the time of making this post, this site is half-baked. I’m afraid that if someone comes onto the website in its current state, it’ll reflect poorly on my own work. <em>But, maybe that’s the motivation I’ve been looking for.</em></p>\n<p><strong>I think that it’s time to keep working.</strong> By that, I mean I need to cover up the potholes and make sure that I finish what I start - all before I add more features. This means cleaning up broken links and adding little bits at a time. Keeping the momentum in building this living site will ensure that I learn more about the Hexo static-site generator as time goes on. Maybe, I’ll contribute additional resources to the generator’s documentation wherever I can!</p>\n<h2 id=\"Roadmap\"><a href=\"#Roadmap\" class=\"headerlink\" title=\"Roadmap\"></a>Roadmap</h2><ul>\n<li>Clean up any missing links/pages/sections. (This will require getting acquainted with some of Hexo’s features).</li>\n<li>Add an About page.</li>\n<li>Learn more about the .ejs template language that came with this blog’s theme!</li>\n<li>Customize the theme!?!?</li>\n<li>Read up about schema! (I’ll be looking at <a href=\"https://schema.org/docs/gs.html#microdata_how\" target=\"_blank\" rel=\"noopener\">schema.org</a>.)</li>\n<li>Continue writing this Roadmap!</li>\n</ul>\n","date_published":"2019-01-22T06:06:33.000Z","date_modified":"2019-01-31T03:18:03.668Z","author":{"name":"Ian Effendi","url":"http://rimij405.github.io"},"tags":"blog,hfoss"}]}